#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t
#+options: todo:t |:t
#+title: Homelab scripts and config for Kubernetes clusters
#+date: <2020-06-13 Sat>
#+author: Gregory Grubbs
#+email: gregory@dynapse.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.0.91 (Org mode 9.3.6)
#+setupfile: ~/projects/emacs/org-html-themes/org/./theme-readtheorg-local.setup
# #+setupfile: https://raw.githubusercontent.com/fniessen/org-html-themes/master/setup/theme-readtheorg.setup
#+PROPERTY: header-args:bash :comments org :shebang #!/usr/bin/env bash :eval never-export

** Debian and Ubuntu deprecated =apt-key= follow these miserable steps instead
   Painful, but necessary for now
   ref: [[https://askubuntu.com/questions/1286545/what-commands-exactly-should-replace-the-deprecated-apt-key][What commands (exactly) should replace the deprecated apt-key? - Ask Ubuntu]]
   ref: [[https://www.linuxuprising.com/2021/01/apt-key-is-deprecated-how-to-add.html][apt-key Is Deprecated. How To Add OpenPGP Repository Signing Keys Without It ...]]
   + Set up the key url and file name, and open a shell in =/tmp=
   #+begin_src emacs-lisp
     (cd "/tmp")
     (shell "gg-tmp-sh")
   #+end_src

   #+name: key-url
   #+begin_src emacs-lisp :results table replace
     (read-string "URL for signing key: ")
   #+end_src

   + Download the key:
     Org-babel note: specify the org variables only on this first session definition to
     avoid being re-prompted for URL
   #+begin_src bash :session gg-tmp-sh :var keyurl=key-url :results none
     export keyfile=$(basename ${keyurl})
     curl -s -L -O ${keyurl}
   #+end_src


   + Verify that the filetype is =PGP public key block Public-Key (old)=
   #+begin_src bash :session gg-tmp-sh :results output replace
     file /tmp/${keyfile}
   #+end_src

   #+RESULTS:
   : /tmp/linux_signing_key.pub: PGP public key block Public-Key (old)

   + If your key is in a different format, convert it by importing it into a temp keyring,
     then exporting it again

     Here we go through the steps regardless because it doesn't hurt to "convert" in any case
   #+begin_src bash :session gg-tmp-sh :results output replace
     gpg --no-default-keyring --keyring ./temp-keyring.gpg --import ${keyfile}
     gpg --no-default-keyring --keyring ./temp-keyring.gpg --export --output ${keyfile}_keyring.gpg
     rm temp-keyring.gpg
   #+end_src

   #+RESULTS:
   #+begin_example
   gpg: keybox './temp-keyring.gpg' created
   " imported
   gpg: key 7721F63BD38B4796: 1 signature not checked due to a missing key
   " imported
   gpg: Total number processed: 2
   gpg:               imported: 2
   gpg: public key of ultimately trusted key 88F1B1F338F524AC not found
   gpg: public key of ultimately trusted key 8BED022043E6E8FC not found
   gpg: marginals needed: 3  completes needed: 1  trust model: pgp
   gpg: depth: 0  valid:   2  signed:   0  trust: 0-, 0q, 0n, 0m, 0f, 2u
   #+end_example

   + Now that you have your converted key, do *not* add it to apt's trusted keystore by
     copying it into =/etc/apt/trusted.gpg.d/=. Instead, put it somewhere like
     =/usr/local/share/keyrings/=. (You'll need to create that keyrings directory first.)
     #+begin_src bash :session gg-tmp-sh :results output replace
       sudo mkdir -p /usr/local/share/keyrings/
       sudo mv -iv ${keyfile}_keyring.gpg /usr/local/share/keyrings/
     #+end_src

     #+RESULTS:
     :
     : renamed 'gpgkey_keyring.gpg' -> '/usr/local/share/keyrings/gpgkey_keyring.gpg'

   + At this point, nothing has changed and apt doesn't know the key exists. The last step
     is to modify the specific =.list= file for the repository to tell apt where to find the
     key for that specific repo.

     Edit the file =/etc/apt/sources.list.d/<example>.list=, and in between deb and the url,
     add =[signed-by=/usr/local/share/keyrings/<your-keyfile-name>.gpg]=

     Now apt will accept that key's signature for all packages in that repo and only that
     repo.

*** DONE Learn some Tigergraph
    DEADLINE: <2021-06-19 Sat 18:55>
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2021-06-27 Sun 15:45]
    CLOCK: [2021-06-27 Sun 12:14]--[2021-06-27 Sun 15:45] =>  3:31
    CLOCK: [2021-06-27 Sun 08:42]--[2021-06-27 Sun 08:57] =>  0:15
    CLOCK: [2021-06-20 Sun 15:02]--[2021-06-20 Sun 15:18] =>  0:16
    CLOCK: [2021-06-20 Sun 11:51]--[2021-06-20 Sun 14:46] =>  2:55
    CLOCK: [2021-06-20 Sun 08:10]--[2021-06-20 Sun 10:30] =>  2:20
    CLOCK: [2021-06-19 Sat 22:29]--[2021-06-19 Sat 23:20] =>  0:51
    CLOCK: [2021-06-19 Sat 22:21]--[2021-06-19 Sat 22:28] =>  0:07
    CLOCK: [2021-06-19 Sat 18:56]--[2021-06-19 Sat 20:34] =>  1:38
    - State "STARTED"    from "TODO"       [2021-06-19 Sat 18:56]
    CREATED: [2021-06-19 Sat 18:55]
    :END:

